name: "model"
platform: "tensorrt_plan"
max_batch_size: 0
default_model_filename: "model.plan"

input: [
    {
        name: "input_ids"
        data_type: TYPE_INT64
        dims: [-1, -1]
    },
    {
        name: "attention_mask"
        data_type: TYPE_INT64
        dims: [-1, -1]
    }
]

output: [
    {
        name: "logits"
        data_type: TYPE_FP32
        dims: [-1, -1, 50257]
    }
]

instance_group: [
    {
        count: 1
        kind: KIND_CPU
    }
]
