name: "model"
platform: "onnxruntime_onnx"
max_batch_size: 0
default_model_filename: "model.onnx"

input: [
    {
        name: "INPUT_IDS"
        data_type: TYPE_INT64
        dims: [-1, -1]
    },
    {
        name: "ATTENTION"
        data_type: TYPE_INT64
        dims: [-1, -1]
    }
]

output: [
    {
        name: "MODEL_OUTPUT"
        data_type: TYPE_INT64
        dims: [-1, -1]
    }
]

instance_group: [
    {
        count: 1
        kind: KIND_CPU
    }
]
